{
    "_meta": {
        "sources": [
            {
                "json": "Tyeia",
                "abbreviation": "TMW",
                "full": "Tyeia's Homebrew",
                "authors": [
                    "Tyeia"
                ],
                "version": "1.0",
                "url": "https://github.com/Tyeia/Tyeia-Homebrew",
				"targetSchema": "1.0.0"
            }
        ],
        "ItemTypes": {
            "D": "diadem",
            "C": "companion"
        },
        "dateAdded": 0
    },
    "itemType":[
        {
            "abbreviation": "D",
            "source": "Tyeia",
            "name": "diadem"
        },
        {
            "abbreviation": "C",
            "source": "Tyeia",
            "name": "companion"
        }
    ],
    "item":[
        {
            "name": "Ascalon",
            "type": "M",
            "weaponCategory": "Martial",
            "baseItem": "longsword|PHB",
            "dmg1": "1d8",
            "dmg2": "1d10",
            "dmgType": "S",
            "property": [
                "V"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a Creature of Good Alignment",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Candor} - If the user of this weapon willingly lies, Ascalon will break attunement.",
                "{@bold Righteousness} - Ascalon has 20 charges. You may use these charges to use the following spells and abilities. These charges restore at dawn.",
                "Spells:",
                "- 3 charges: {@spell Suggestion}",
                "- 5 charges: {@spell Zone of Truth}",
                "- 8 charges: {@spell Dominate Person}",
                "- 10 charges: {@spell Mass Suggestion}",
                "The level for these spells is their lowest level or half your level(max 9th), whichever is higher.",
                "The Spell DC for these spells is (8 + Proficiency + Charisma + Magic Bonus)",
                "Abilities:",
                "- 3 charges: Adaptive Form - Ascalon Transforms into a greatsword for 5 minutes, giving it the two-handed property and increasing its damage to 2d6",
                "- 5 charges: Full Counter - Using a reaction when you take an instance of damage, you deal the damage that you take back to the source of the damage. You must take the damage to use this ability.",
                "- 15 charges: Righteous Slash - You gather power in Ascalon and strike the ground with righteous might. Every creature in a (15 + 15*Magic Bonus)ft cone must make a Dexterity save, the DC for this save is (8 + Proficiency + Charisma + Magic Bonus). On a failed save, the creature takes (1+(4*Magic Bonus)d8 radiant damage. On a successful save, the creature takes half damage instead."
            ]
        },
        {
            "name": "Belial",
            "type": "M",
            "weaponCategory": "Simple",
            "baseItem": "dagger|PHB",
            "dmg1": "2d4",
            "dmgType": "S",
            "property": [
                "F"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Liars} - You may have anyone within 30ft make a DC18 Charisma or Wisdom save when they attempt to speak. If they fail, they must tell a lie.",
                "{@bold Deceiver} - Your damage is doubled against anyone you have deceived in a large way. You also gain advantage on any Deception checks you make."
            ]
        },
        {
            "name": "Covenant",
            "type": "GV",
            "weaponCategory": [
                "Martial",
                "Simple"
            ],
            "wondrous":true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Strong Bond} - Covenant will change form to match the weapon type its new user is most familiar with during attunement. If ammunition is needed for the weapon, Covenant will produce its own. After attunement is broken, it will remain in this form until a new user attunes to it.",
                "{@bold Legacy} - Covenant takes after its users, collecting 3 features or spells from them during the course of its use. After you break attunement with Covenant for the final time, select 3 class features or spells. Covenant will now have these abilities available for future users. The amount of times a feature or spell can be used is also taken from the original owner. These features and spells remain on the weapon permanently, only being replaced if the current user has a superior version. These abilities only become available to use once you have reached the level to use them initially. (Example: You can unlock Action Surge(two uses) at level 2, even though Fighters normally unlock the second use at level 17)."
            ]
        },
        {
            "name": "Duo",
            "type": "D",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a psionics user",
            "entries": [
                "{@bold Relic} - This item grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This bonus is added to your psionic discipline attack modifier and save DC.",
                "{@bold Psion's Boon} - You may focus on one more discipline at a time to gain its benefits.",
                "{@bold Psionic Storage} - You may store psi points up to your maxiumum inside of Duo. You may use these psi points as normal."
            ]
        },
        {
            "name": "Harbinger",
            "type": "M",
            "weaponCategory": "Simple",
            "dmg1": "2d6",
            "dmgType": "S",
            "property": [
                "R"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Blood Pact} - Attuning to Harbinger requires you to allow it to gorge on your blood. If you allow this, you will lose a number equal to your level in maxiumum HP and gain 1 less HP per level. This pact makes it so your attunement can only be broken if you willingly break attunement.",
                "{@bold Blood Sense} - You are able to sense the location of any blood bearing creature within 60 feet.",
                "{@bold Predator} - Harbinger has an amount of charges equal to your level. You may spend hit dice at any time to feed Harbinger to restore charges(roll the hit dice). You lose health equal to the amount rolled, and Harbinger gains charges equal to the amount rolled. You may use your charges to do the following:",
                "- 1 charge: As a reaction: Reroll any of your attack or damage rolls you made with Harbinger. You must keep the new result.",
                "- 5 charges: When making an attack with Harbinger: If your attack hits, you will heal the damage dealt to the enemy. You must choose to use this before you roll for your attack.",
                "- 10 charges: When making an attack action with Harbinger, you may teleport up to 30 feet to a blood-bearing target. You may only do this before the first attack if you have the Extra Attack feature.",
                "- 20 charges: You let Harbinger consume more of your blood for a time to improve its power. Your hit point maximum is halved, but you roll an extra set of damage die for damage when using Harbinger. These effects last for 1 minute, after which, your hit point maximum is returned to its usual value."
            ]
        },
        {
            "name": "Io",
            "type": "M",
            "weaponCategory": "Martial",
            "baseItem": "halberd|PHB",
            "dmg1": "1d10",
            "dmgType": "S",
            "property": [
                "R",
                "H",
                "2H"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a healer",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold An Odd Fit} - You gain proficiency in halberds while attuned to Io.",
                "{@bold Attendant} - Whenever you attempt to cast a healing spell, you may spend 10*(the spell's level) hit points to cast the spell instead of a spell slot. When you cast a healing spell in this way, your healing has cascade(exploding dice). Also, whenever you are within 5 feet of an ally, you gain your magic bonus to AC and all saves.",
                "{@bold To Eternity} - As an action, you may place a willing creature into a suspended animation. This creature will not age, cannot be damaged, and needs no food or water. This creature will remain in this state until a set point, decided when Io's user put them in this state, or until a user of Io releases them. Io can only hold one creature in suspended animation at a time.",
                "{@bold Dweller in the Dark} - During a long rest, you may summon a white tree that casts {@spell Goodberry} This feature restores at dawn the day after it was used."
            ]
        },
        {
            "name": "Logia",
            "type": "M",
            "weaponCategory": "Martial",
            "baseItem": "greatsword|PHB",
            "dmg1": "2d6",
            "dmgType": "S",
            "property": [
                "H",
                "2H"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune" : "by someone with no spell slots",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Magic Resistance} - While wielding Logia, you have advantage on saving throws against spells, and spells have disadvantage on attacks against you.",
                "{@bold Anti-Magic} - Logia innately bypasses the effects of {@spell Shield} and {@spell Mage Armor}. If its user develops spell slots, Logia will consume all of them and not allow them to restore. Additionally, Logia has 15 charges, which fully restore at dawn. You may cast the following spells using these charges:",
                "- 3 charges: {@spell Counterspell}",
                "- 3 charges: {@spell Dispel Magic}",
                "- 10 charges: {@spell Antimagic Field}",
                "The level for these spells is their lowest level or half your level(max 9th), whichever is higher."
            ]
        },
        {
            "name": "Mantle",
            "type": "T",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by an artificer",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This magic bonus is added to your AC",
                "{@bold Trace} - You may improve the quality of a weapon you are holding as an action, giving it Mantle's magic bonus for 1 minute. You can only do this a number of times equal to your proficiency bonus per long rest.",
                "{@bold Unlimited Bladeworks} - As an action, you may create a single copy of every weapon or relic you can see. Your copies are lesser than the originals. If the original has any magic bonus, it is reduced by half for the copy. If the original has charges, the copy has half of the maximum amount. After one use, be it an attack or feature, the copy will break. All copies are considered attuned to you, ignoring attunement slots or restrictions, and you have proficiency with them. All copies will break after one hour. This feature restores on a long rest."
            ]
        },
        {
            "name": "Nexus",
            "type": "SCF",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a wizard",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This magic bonus is added to your save DC, spell attack modifier, spell damage, and all saves",
                "{@bold A Spellbook with No Cover} - Nexus has unlimited blank pages. It costs nothing to put spells into this spellbook.",
                "{@bold Peak of Arcanum} - Nexus gives you a spell slot of a level equal to half of your level, round up(max 10th). You may only use this to cast lower level spells at this level.",
                "{@bold Pocket Dimension} - As a bonus action, you may store Nexus in its pocket dimension. When you do this, you trade it for the key to the pocket dimension, a staff that grants the same effects of the spellbook. The staff can be treated as the spellbook for the sake of spellcasting and class/item features. As a bonus action, you may retrieve the spellbook using the staff"
            ]
        },
        {
            "name": "Rose",
            "type": "INS",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a bard",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This magic bonus is added to your save DC, spell attack modifier, spell damage, and all saves",
                "{@bold One Man Band} - Rose can transform into any instrument as a bonus action.",
                "{@bold Superior Music} - Both your Song of Rest and Bardic Inspiration use the next higher die. When you would normally use a 1d12, you use 1d20",
                "{@bold Minstrel's Charms} - Over the course of 1 minute, you may have any number of creatures that can hear your music roll either a Wisdom or Charisma saving throw against your spell DC or become charmed by you. Creatures may attempt this save again every minute. If they make their save against this effect, they are immune to it for 24 hours."
            ]
        },
        {
            "name": "Sentinel",
            "type": "HA",
            "armor": true,
            "baseItem": "plate armor|PHB",
            "ac": 18,
            "stealth": true,
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This armor grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Modes of Operation} - As you level you unlock different modes this armor can operate in:",
                "- Level 5: Sentry - You may doff/don the armor as an action. When Sentinel is not worn, it will act on its own, following your commands. The armor will activate this mode automatically when you fall unconscious. If you are inside of it when you fall unconscious, you will remain inside of it. When in this mode, Sentinel uses the statblock for a {@creature Warforged Soldier|ERLW} scaled to a CR equal to your level.",
                "- Level 10: Juggernaut - Your armor doubles in size, producing more plate from seemingly nowhere. This gives the following effects:",
                {
                    "type": "list",
                    "items": [
                        "The base AC of Sentinel rises to 22",
                        "Your size is now Large, but you gain no bonus to lifting/dragging strength",
                        "You gain resistance to all damage",
                        "You deal half damage",
                        "Your walking speed is halved",
                        "Your swim speed is zero, but you sink in water",
                        "Sentinel provides oxygen for you in a sealed environment",
                        "You have disadvantage on all dexterity checks",
                        "Your voice can barely be heard from outside the armor"
                    ]
                },
                "- Level 15: Golem - You can use Sentry and Juggernaut together. When you do this, use the {@creature Iron Golem|MM} statblock with an AC of 22 for the armor instead of the {@creature Warforged Soldier|ERLW} statblock.",
                "- Level 20: Fortress - You become invulnerable for 10 minutes, but while you are invulnerable in this way you are treated as if you were under the effects of {@spell Feeblemind|PHB}. You can only use this ability while wearing Sentinel."
            ]
        },
        {
            "name": "Tenrou",
            "type": "C",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a nature magic user",
            "entries": [
                "{@bold Relic} - This companion grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This magic bonus is added to its AC, all saves, attacks, and damage",
                "{@bold Multipurpose} - Tenrou may transform into any land-dwelling Beast with a maximum CR of a quarter of your level. Its stats change to match.",
                "{@bold Dutiful} - Tenrou cannot be killed. When it is reduced to 0HP, it goes dormant, entering a sleep-like state for 8 hours, and then is restored to full HP. You can move Tenrou in this state, but Tenrou cannot transform.",
                "{@bold Heavenly Wolf} - As an action you may speak Tenrou's command word and it will transform into a Huge {@creature Dire Wolf} with a CR of half your level for 10 minutes. This ability restores at the dawn at the beginning of the next week."
            ]
        },
        {
            "name": "Valkyrija",
            "type": "M",
            "baseItem": "sickle|PHB",
            "weaponCategory": "Simple",
            "dmg1": "1d6",
            "dmgType": [
                "S",
                "B"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a female",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Wager} - When attuning to Valkyrija, you accept the terms of its contract. If you die while attuned to Valkyrija, it consumes your soul",
                "{@bold Bonded Blade} - Should you throw either end of Valkyrija, you can return it to your hand as a free action. You must be holding one end of Valkyrija to use this feature. You may also use Valkyrija to traverse terrain, either by swinging or climbing.",
                "{@bold Soul Eater} - Valkyrija consumes the souls of its foes. It restores used charges equal to the CR or level of the enemy killed, consuming its soul.",
                "{@bold Soul Chains} - Valkyrija has 25 charges. You may use these charges to do the following:",
                "- 1 charge: You may add +1 to any attack roll or damage roll",
                "- 5 charges: Your melee attacks have a range of 15 feet for 1 minute",
                "- 10 charges: Restrain an enemy within 10 feet with Valkyrija's chains as an action. This may be considered an attack for the Extra Attack feature",
                "- 20 charges: The weight end of the sickle transforms into another sickle as soul energy wraps around you. For the next minute, Valkyrija can only deal slashing damage, your melee attacks have a range of 10ft, and you may perform an extra attack using your bonus action."
            ]
        }
    ]
}