{
    "_meta": {
        "sources": [
            {
                "json": "Tyeia",
                "abbreviation": "TMW",
                "full": "Tyeia's Homebrew",
                "authors": [
                    "Tyeia"
                ],
                "version": "1.0",
                "url": "https://github.com/Tyeia/Tyeia-Homebrew",
				"targetSchema": "1.0.0"
            }
        ],
        "dateAdded": 0
    },
    "item":[
        {
            "name": "Ascalon",
            "type": "M",
            "weaponCategory": "Martial",
            "dmg1": "1d8",
            "dmg2": "1d10",
            "dmgType": "S",
            "property": [
                "V"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a Creature of Good Alignment",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Candor} - If the user of this weapon willingly lies, Ascalon will break attunement.",
                "{@bold Righteousness} - Ascalon has 20 charges. You may use these charges to use the following spells and abilities. These charges restore at dawn.",
                "Spells:",
                "- 3 charges: {@spell Suggestion}",
                "- 5 charges: {@spell Zone of Truth}",
                "- 8 charges: {@spell Dominate Person}",
                "- 10 charges: {@spell Mass Suggestion}",
                "Abilities:",
                "- 3 charges: Adaptive Form - Ascalon Transforms into a greatsword for 5 minutes, giving it the two-handed property and increasing its damage to 2d6",
                "- 5 charges: Full Counter - Using a reaction when you take an instance of damage, you deal the damage that you take back to the source of the damage. You must take the damage to use this ability.",
                "- 15 charges: Righteous Slash - You gather power in Ascalon and strike the ground with righteous might, dealing ((4*Magic Bonus)d8(minimum 1) damage to any creature in a (15 + 15*Magic Bonus)ft cone"
            ]
        },
        {
            "name": "Belial",
            "type": "M",
            "weaponCategory": "Simple",
            "dmg1": "2d4",
            "dmgType": "S",
            "property": [
                "F"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Liars} - Anyone within 60ft must make a DC18 Charisma or Wisdom save when they attempt to speak. If they fail, they must tell a lie.",
                "{@bold Deceiver} - Your damage is doubled against anyone you have deceived. You also gain advantage on any Deception checks you make."
            ]
        },
        {
            "name": "Covenant",
            "type": "GV",
            "weaponCategory": [
                "Martial",
                "Simple"
            ],
            "wondrous":true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Strong Bond} - Covenant will change form to match the weapon type its new user is most familiar with during attunement. If ammunition is needed for the weapon, Covenant will produce its own. After attunement is broken, it will remain in this form until a new user attunes to it.",
                "{@bold Legacy} - Covenant takes after its users, collecting 3 features or spells from them during the course of its use. After you break attunement with Covenant for the final time, select 3 class features or spells. Covenant will now have these abilities available for future users. The amount of times a feature or spell can be used is also taken from the original owner. These features and spells remain on the weapon permanently, only being replaced if the current user has a superior version."
            ]
        },
        {
            "name": "Duo",
            "type": "Diadem",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a psionics user",
            "entries": [
                "{@bold Relic} - This item grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This bonus is added to your psionic discipline attack modifier and save DC.",
                "{@bold Psion's Boon} - You may focus on one more discipline at a time to gain its benefits.",
                "{@bold Psionic Storage} - You may store psi points up to your maxiumum inside of Duo. You may use these psi points as normal."
            ]
        },
        {
            "name": "Harbinger",
            "type": "M",
            "weaponCategory": "Simple",
            "dmg1": "2d6",
            "dmgType": "S",
            "property": [
                "R"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": true,
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Blood Pact} - Attuning to Harbinger requires you to allow it to gorge on your blood. If you allow this, you will lose a number equal to your level in maxiumum HP and gain 1 less HP per level. This pact makes it so your attunement can only be broken if you willingly break attunement.",
                "{@bold Blood Sense} - You are able to sense the location of any blood bearing creature within 60 feet.",
                "{@bold Predator} - Harbinger has an amount of charges equal to your level. During a long rest you may spend hit dice to feed Harbinger to restore charges(roll the hit dice). You lose health equal to the amount rolled, and Harbinger gains charges equal to the amount rolled. You may use your charges to do the following:",
                "- 1 charge: As a reaction: Reroll any of your attack or damage rolls you made with Harbinger. You must keep the new result.",
                "- 5 charges: When making an attack with Harbinger: If your attack hits, you will heal the damage dealt to the enemy. You must choose to use this before you roll for your attack.",
                "- 10 charges: When making an attack action with Harbinger, you may teleport up to 30 feet to a blood-bearing target. You may only do this before the first attack if you have the Extra Attack feature.",
                "- 20 charges: You let Harbinger consume more of your blood for a time to improve its power. Your hit point maximum is halved, but you roll an extra set of damage die for damage when using Harbinger. These effects last for 1 minute, after which, your hit point maximum is returned to its usual value."
            ]
        },
        {
            "name": "Io",
            "type": "M",
            "weaponCategory": "Martial",
            "dmg1": "1d10",
            "dmgType": "S",
            "property": [
                "R",
                "H",
                "2H"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by a healer",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold An Odd Fit} - You gain proficiency in halberds while attuned to Io.",
                "{@bold Attendant} - Whenever you have run out of spell slots and attempt to cast a healing spell, you may spend 10*(the spell's level) hit points to cast the spell. Also, whenever you are within 5 feet of an ally, you gain +1 to AC and all saves.",
                "{@bold To Eternity} - As an action, you may place a willing creature into a suspended animation. This creature will not age, cannot be damaged, and needs no food or water. This creature will remain in this state until a set point, decided when Io's user put them in this state, or until a user of Io releases them. Io can only hold one creature in suspended animation at a time.",
                "{@bold Dweller in the Dark} - During a long rest, you may summon a white tree that casts {@spell Goodberry} This feature restores at dawn the day after it was used."
            ]
        },
        {
            "name": "Logia",
            "type": "M",
            "weaponCategory": "Martial",
            "dmg1": "2d6",
            "dmgType": "S",
            "property": [
                "H",
                "2H"
            ],
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune" : "by someone with no spell slots",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down.",
                "{@bold Magic Resistance} - While wielding Logia, you have advantage on saving throws against spells, and spells have disadvantage on attacks against you.",
                "{@bold Anti-Magic} - Logia innately bypasses the effects of Shield and Mage Armor. If its user develops spell slots, Logia will consume all of them and not allow them to restore. Additionally, Logia has 15 charges, which fully restore at dawn. You may cast the following spells using these charges:",
                "- 3 charges: {@spell Counterspell}",
                "- 3 charges: {@spell Dispel Magic}",
                "- 10 charges: {@spell Antimagic Field}"
            ]
        },
        {
            "name": "Mantle",
            "type": "T",
            "wondrous": true,
            "rarity": "Artifact",
            "source": "Tyeia",
            "reqAttune": "by an artificer",
            "entries": [
                "{@bold Relic} - This weapon grows with you. Its magic bonus is equal to half of your proficiency bonus, rounded down. This magic bonus is added to your AC",
                "{@bold Trace} - You may improve the quality of a weapon you are holding as an action, giving it a +1 magic bonus for 1 minute. You can only do this a number of times equal to your proficiency bonus per long rest.",
                "{@bold Unlimited Bladeworks} - As an action, you may create a single copy of every weapon or relic you can see. Your copies are lesser than the originals. If the original has any magic bonus, it is reduced by half for the copy. If the original has charges, the copy has half of the maximum amount. After one use, be it an attack or feature the copy will break. All copies are considered attuned to you, ignoring attunement slots or restrictions, and you have proficiency with them. All copies will break after one hour. This feature restores on a long rest."
            ]
        }
    ]
}